Butterfly roadmap step1 and 2 BlockMeshDict STL example/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions"
    }

    Building
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ground
    {
        type            fixedValue;
	  value    	  constant (0 0 0);
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
